{
  "backend/main.mo": "Main backend actor implementing movie database, user profiles, watchlist management, and authorization using mixins for storage and access control with role-based permissions.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (splash screen, home screen, categories, AI recommendations, movie details, search, watchlist, profile, kids mode) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a dark cinematic color scheme using HSL values for both light and dark themes.",
  "frontend/index.html": "HTML entry point for the CineVerse React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with splash screen logic, route definitions for all pages, theme provider, and profile setup modal.",
  "frontend/src/components/AIRecommendations.tsx": "Component displaying personalized movie recommendations with sparkle icon for authenticated users, showing first 6 movies from the catalog.",
  "frontend/src/components/CategorySection.tsx": "Reusable component rendering a horizontal scrollable section of movies filtered by category with title and chevron icon.",
  "frontend/src/components/ContinueWatching.tsx": "Component showing partially watched movies with progress bars for authenticated users, displaying first 3 movies from catalog.",
  "frontend/src/components/KidsModeToggle.tsx": "Toggle switch component with baby icon for enabling/disabling Kids Mode using custom hook and shadcn UI components.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing consistent structure with bottom navigation bar and outlet for child routes.",
  "frontend/src/components/LoginButton.tsx": "Authentication button using Internet Identity with login/logout functionality, loading states, and query cache clearing on logout.",
  "frontend/src/components/MovieCard.tsx": "Reusable movie card component displaying poster, rating with star icon, title, and watch button with hover effects and navigation.",
  "frontend/src/components/Navigation.tsx": "Bottom navigation bar component with four tabs (Home, Categories, Watchlist, Profile) using TanStack Router for navigation and highlighting the active route.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter their name to create a profile with preferences.",
  "frontend/src/components/SearchBar.tsx": "Search input component with live suggestions that filters movies by title and displays up to 5 results with poster thumbnails, navigating to movie details on selection.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen splash screen displaying the CineVerse logo and title with fade-out animation after 2 seconds.",
  "frontend/src/components/TrendingCarousel.tsx": "Auto-rotating carousel displaying the first 5 movies with background posters, navigation controls, and a 'Watch Now' button that links to movie details.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook that combines Internet Identity state with user profile data, providing login/logout functions and authentication status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login flow, identity persistence, and authentication status states.",
  "frontend/src/hooks/useKidsMode.ts": "Hook that provides kids mode state from user profile and a toggle function to switch kids mode on/off by updating the profile.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including fetching movies, managing user profiles, and watchlist CRUD operations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme colors (background, foreground, primary red accent) and utility classes for scrollbar hiding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/Categories.tsx": "Displays a grid of movie categories (Action, Comedy, Kids, Bollywood, Hollywood) with gradient overlays and images, navigating to home on click.",
  "frontend/src/pages/Home.tsx": "Main landing page showing search bar, trending carousel, continue watching, AI recommendations, and category sections; displays kids-mode banner and filtered content when kids mode is active.",
  "frontend/src/pages/MovieDetail.tsx": "Displays detailed movie information including poster, rating, categories, and description with watch now and watchlist toggle buttons; requires authentication for watchlist actions.",
  "frontend/src/pages/Profile.tsx": "User profile page showing avatar, username, principal ID, kids mode toggle, and login button; displays login prompt if not authenticated.",
  "frontend/src/pages/Watchlist.tsx": "Displays user's saved watchlist as a grid of movie cards; shows login prompt if not authenticated or empty state if no movies are saved.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including color variables, border radius, cinematic shadows, and custom animations for accordions, fades, and zooms.",
  "project_state.json": "Project state file for CineVerse Android movie streaming app with dark cinematic UI, tracking 10 implemented features including splash screen, home screen with trending carousel, categories, AI recommendations, movie details, search, watchlist, continue watching, kids mode, and user profiles. Includes architectural notes about Netflix/Disney+ style OTT interface and required image assets for branding and movie posters."
}